Revit 2027 API
CurveLoop.Append Method
 Append the curve to this loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Append(
	Curve curve
)
Public Sub Append (
	curve As Curve
)
public:
void Append(
	Curve^ curve
)
member Append :
        curve : Curve -> unit
Parameters
curve Curve
 The curve.
Exceptions
Exception | Condition
ArgumentException |  The input curve points to a helical curve and is not supported for this operation. -or- Throws if the input curve makes the loop not contiguous.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace